Revit 2027 API
ElectricalAnalyticalLoadSet.Create Method
 Creates an electrical analytical load set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElectricalAnalyticalLoadSet Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As ElectricalAnalyticalLoadSet
public:
static ElectricalAnalyticalLoadSet^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> ElectricalAnalyticalLoadSet
Parameters
document Document
 The document where the new element will be created.
name String
 The name of new electrical analytical load set. The actual name may be post-fixed if already exists.
Return Value
ElectricalAnalyticalLoadSet
 The newly created electrical analytical loadset.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace